HTML_and_CSS_Design_and_Build_Websites/015.Layout/015.000.Notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-07 Tue 21:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Chapter 15: Layout</title>
<meta name="author" content="Alfredo Mejia" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../resources/bulma/bulma.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Chapter 15: Layout</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4338ec5">Navigation</a></li>
<li><a href="#org14cb2d3">Notes</a>
<ul>
<li><a href="#org6555101">Section 15.1: Key Concepts in Positioning Elements</a></li>
<li><a href="#org3adc866">Section 15.2: Controlling the Position of Elements</a></li>
<li><a href="#org530a4f9">Section 15.3: Normal Flow</a></li>
<li><a href="#org97552d2">Section 15.4: Relative Positioning</a></li>
<li><a href="#org073b469">Section 15.5: Overlapping Elements</a></li>
</ul>
</li>
<li><a href="#org374e508">Keywords</a></li>
<li><a href="#org3110a9a">Questions</a></li>
<li><a href="#org6db1f2c">Summary</a></li>
</ul>
</div>
</div>

<div id="outline-container-org4338ec5" class="outline-2">
<h2 id="org4338ec5">Navigation</h2>
<div class="outline-text-2" id="text-org4338ec5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Nav</th>
<th scope="col" class="org-left">Title</th>
<th scope="col" class="org-left">Links</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Index</td>
<td class="org-left">Notes Home</td>
<td class="org-left">&vert; <a href="../../index.html">html</a> &vert; <a href="../../index.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Home</td>
<td class="org-left">HTML &amp; CSS - Design and Build Websites</td>
<td class="org-left">&vert; <a href="../000.Home.html">html</a> &vert; <a href="../000.Home.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/HTML_and_CSS_Design_and_Build_Websites">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Prev</td>
<td class="org-left">Chapter 14: Lists, Tables &amp; Forms</td>
<td class="org-left">&vert; <a href="../014.Lists_Tables_and_forms/014.000.Notes.html">html</a> &vert; <a href="../014.Lists_Tables_and_Forms/014.000.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/HTML_and_CSS_Design_and_Build_Websites/014.Lists_Tables_and_Forms">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Next</td>
<td class="org-left">Chapter 16: Images</td>
<td class="org-left">&vert; <a href="../016.Images/016.000.Notes.html">html</a> &vert; <a href="../016.Images/016.000.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/HTML_and_CSS_Design_and_Build_Websites/016.Images">github</a> &vert;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org14cb2d3" class="outline-2">
<h2 id="org14cb2d3">Notes</h2>
<div class="outline-text-2" id="text-org14cb2d3">
</div>
<div id="outline-container-org6555101" class="outline-3">
<h3 id="org6555101">Section 15.1: Key Concepts in Positioning Elements</h3>
<div class="outline-text-3" id="text-org6555101">
<ul class="org-ul">
<li>CSS treats each HTML element as if it is in its own box; this box will either be a block-level box or an inline box</li>
<li>Block level boxes start on a new line and act as the main building blocks of any layout</li>
<li>Inline level boxes flow between surrounding text</li>
<li>You can control how much space each box takes up by setting the width of the boxes (and sometimes the height too)</li>
<li>To separate boxes, you can use borders, margins, padding, and background colors</li>
<li>If one block-level element sits inside another block-level element then the outer box is known as the containing or parent element</li>
<li>It is common to group a number of elements inside a <code>&lt;div&gt;</code> (or other block-level) element (e.g. you might group together all of the elements that form the header of a site such as the logo and the main navigation)</li>
<li>The block element (e.g. <code>&lt;nav&gt;</code>) contining a group of elements is then referred to as the containing element</li>
<li>A box may be nested inside several other block-level elements (the containing element is always the direct parent of that element)</li>
</ul>
</div>
</div>

<div id="outline-container-org3adc866" class="outline-3">
<h3 id="org3adc866">Section 15.2: Controlling the Position of Elements</h3>
<div class="outline-text-3" id="text-org3adc866">
<ul class="org-ul">
<li>CSS has the following <b>positioning schemes</b> that allow you to control the layout of a page: normal flow, relative positioning, and absolute positioning</li>
<li>You can specify the positioning scheme using the <code>position</code> property in CSS and you can float elements using the <code>float</code> property</li>
<li><b>Normal Flow</b>: Every block-level element appears on a new line, causing each item to appear lower down the page than the previous one</li>
<li>Even if you change the width of the boxes so they can fit in a single line they will <b>not</b> appear next to each other unless you tell the browser to do something different</li>
<li><b>Relative Positioning</b>: This moves an element from the position it would be in normal flow, shifting it to the top, right, bottom, or left of where it would have been placed (this does not affect the position of surrounding elements; they stay in the position they would be in normal flow)</li>
<li><b>Absolute Positioning</b>: This positions the element in relation to its containing element as it is taken out of normal flow meaning that it does not affect the position of any surrounding elements as they simply ignore the space it would have taken up</li>
<li>Absolutely positioned elements move as users scroll up and down the page</li>
<li><b>Fixed Positioning</b>: This is a form of absolute positioning that positions the element in relation to the browser window, as opposed to the containing element</li>
<li>Fixed positioned elements do not affect the position of surrounding elements and they do not move when the user scrolls up or down the page</li>
<li><b>Floating Elements</b>: Floating an element allows you to take that element out of normal flow and position it to the far left or right of a containing box</li>
<li>The floating element becomes a block-level element around which other content can flow</li>
<li>To indicate where a box should be positioned, you may also need to use box offset properties to tell the browser how far from the top or bottom and left or right it should be placed</li>
<li>When you move any element from normal flow, boxes can overlap and thus the <code>z-index</code> property allows you to control which box appears on top</li>
</ul>
</div>
</div>

<div id="outline-container-org530a4f9" class="outline-3">
<h3 id="org530a4f9">Section 15.3: Normal Flow</h3>
<div class="outline-text-3" id="text-org530a4f9">
<ul class="org-ul">
<li>In normal flow, each block-level element sits on top of the next one (this is the default behavior of HTML)</li>
<li>You don't need a CSS property to indicate that the elements should appear in normal flow but the syntax would be <code>position: static</code></li>
<li>Here's an <a href="./015.003.Normal_Flow_Example/index.html">example</a></li>
<li>As you can see in the example, the paragraph blocks take up 50% and 25% respectively but they do not sit side by side instead they go onto the next line despite there being space</li>
<li>I also wanted to test the <code>position: static</code> attribute so I created two divs, the top one is without a <code>position</code> attribute and the bottom one is with the <code>position</code> attribute and as expected the default behavior is the same as <code>position: static</code></li>
</ul>
</div>
</div>

<div id="outline-container-org97552d2" class="outline-3">
<h3 id="org97552d2">Section 15.4: Relative Positioning</h3>
<div class="outline-text-3" id="text-org97552d2">
<ul class="org-ul">
<li>Relative positioning moves an element in relation to where it would have been in normal flow</li>
<li>For example, you can move it 10 pixels lower than it would have been in normal flow or 20% to the right</li>
<li>You can indicate that an element should be relatively positioned using the <code>position: relative</code> property</li>
<li>You can then use the offset properties, <code>top</code>, <code>bottom</code>, <code>left</code>, and <code>right</code> to indicate how far to move the element from where it would have been in normal flow</li>
<li>The values of the box offset properties are usually given in pixels, percentages, or ems</li>
<li>Here's an <a href="./015.004.Relative_Positioning_Example/index.html">example</a></li>
<li>The example shows that relative positioning is all relative to the position of the element when it is in normal flow</li>
<li>Thus if you offset the element from its normal flow position and it stays within bounds meaning it looks like it belongs or it doesn't overlap with other elements then great</li>
<li>But what if we offset too much, what happens?</li>
<li>In the example, I offset two elements relative to their normal flow position</li>
<li>The first element I put it to the right and down but I did it so much so that it overlap with other elements</li>
<li>This overlapping stays overlapped and does not affect the position of the affected elements</li>
<li>The last element I pushed to the right but since there are no elements there it seems like it belongs there but if there were elements there it would also overlap</li>
<li>Thus relative positioning moves elements relative to their normal flow position to any place in the web page, it doesn't matter if it is super far, in another div, or there are elements there, the element will move based on its original position and offset</li>
<li>Relative positioning may overlap with other elements and stay in that position but will not affect the position of other elements (besides taking space in its original normal flow position)</li>
</ul>
</div>
</div>

<div id="outline-container-org073b469" class="outline-3">
<h3 id="org073b469">Section 15.5: Overlapping Elements</h3>
</div>
</div>

<div id="outline-container-org374e508" class="outline-2">
<h2 id="org374e508">Keywords</h2>
<div class="outline-text-2" id="text-org374e508">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Term</th>
<th scope="col" class="org-left">Definition</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Block-level box</td>
<td class="org-left">Boxes that start on a new line and act as the main building blocks of any layout</td>
</tr>

<tr>
<td class="org-left">Inline-level box</td>
<td class="org-left">Boxes that flow between surrounding text</td>
</tr>

<tr>
<td class="org-left">Normal Flow Position</td>
<td class="org-left">Every block-level element appears on a new line even if there is space in the current line thus causing each item to appear lower down the page than the previous one</td>
</tr>

<tr>
<td class="org-left">Rleative Positioning</td>
<td class="org-left">This moves an element from the position it would be in normal flow, shifting it to the top, right, bottom, or left of where it would have been placed (this does not affect the position of surrounding elements; they stay in the position they would be in normal flow)</td>
</tr>

<tr>
<td class="org-left">Absolute Positioning</td>
<td class="org-left">This positions the element in relation to its containing element as it is taken out of normal flow meaning that it does not affect the position of any surrounding elements as they simply ignore the space it would have taken up</td>
</tr>

<tr>
<td class="org-left">Fixed Positioning</td>
<td class="org-left">This is a form of absolute positioning that positions the element in relation to the browser window, as opposed to the containing element</td>
</tr>

<tr>
<td class="org-left">Floating Elements</td>
<td class="org-left">Floating an element allows you to take that element out of normal flow and position it to the far left or right of a containing box</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org3110a9a" class="outline-2">
<h2 id="org3110a9a">Questions</h2>
<div class="outline-text-2" id="text-org3110a9a">
<ul class="org-ul">
<li><b>Q</b>:</li>
</ul>
</div>
</div>

<div id="outline-container-org6db1f2c" class="outline-2">
<h2 id="org6db1f2c">Summary</h2>
<div class="outline-text-2" id="text-org6db1f2c">
<ul class="org-ul">
<li>CSS treats each HTML element as if it is in its own box</li>
<li>The box is either block-level box (which start on a new line and act as the main building blocks of any layout) or inline-level box (which flow between surrounding text)</li>
<li>There may be nested block-level elements and the block-level element that contains the nested block-level elements are referred to as the containing element or direct parent of the nested block elements</li>
</ul>
</div>
</div>
</div>
</body>
</html>
